User_panal/stock_exchange_web_signup_testing/stockweb_signup_testing-Combined-JMeter-and-Selenium.yaml
---
# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: stockweb_signup_testing-Selenium
  hold-for: 20m

- executor: jmeter
  scenario: stockweb_signup_testing-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  stockweb_signup_testing-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://localhost:33143/UserRegister)
      - clickByID(signUpObject_Name)
      - typeByID(signUpObject_Name): "jeter_testing"
      - clickByID(signUpObject_Email)
      - typeByID(signUpObject_Email): "jeter_testing@gmail.com"
      - typeByID(signUpObject_Password): "jeter_testing123"
      - typeByID(signUpObject_Repeat_Password): "jeter_testing123"
      - clickByCSS(input.btn.btn-primary)

  stockweb_signup_testing-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.98 Safari/537.36'
      Referer: 'http://localhost:33143/UserRegister'
      Accept-Encoding: 'gzip, deflate, br'
      Accept-Language: 'en-US,en;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:33143/UserRegister/DbSignUp'
            method: POST
            label: 'http://localhost:33143/UserRegister/DbSignUp'
            think-time: 0ms
            headers:
              Origin: 'http://localhost:33143'
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
            body:
              __RequestVerificationToken: IPtYPEFG6uovsMfNb_jk0-5NgsDscic3NTvVpK4y8GRHv1xhUPzNCkeKBbqo4NDBCfZFab31lk4431razst59M6_GOPapFYsqDquttWSoxQ1
              signUpObject.Email: jeter_testing@gmail.com
              signUpObject.Name: jeter_testing
              signUpObject.Password: jeter_testing123
              signUpObject.Repeat_Password: jeter_testing123
          - url: 'http://localhost:33143/UserRegister'
            method: GET
            label: 'http://localhost:33143/UserRegister'
            think-time: 4672ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
          - url: 'http://localhost:39400/410ca67ca57a4811979f53c7de2dd2fa/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAACJ65TvR%2Bk8IjqmECWRr3UEvdCM3rZlWlIzw2uuMwabVQAAAAAOgAAAAAIAACAAAAAQrdEItF1t69HcU6PxwbnxIdqFx9doRK%2FU7hOpQkxQsjAAAAAeWYQCQuW0RdzXC089Lq9qG5Xq6WlkQPFe%2Bc68tVpL2snOJgzQcGH2%2FgpwcNATeaNAAAAA8u5f1vxqkylKi5j5Yt0NvVgBvH7228ULKjuitp4i4ab6QXg4zhNAkWKI%2FG0OfoBB8bJupD%2FwHsDnZ825XIewMw%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FUserRegister&browserName=Chrome'
            method: POST
            label: 'http://localhost:39400/410ca67ca57a4811979f53c7de2dd2fa/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAACJ65TvR%2Bk8IjqmECWRr3UEvdCM3rZlWlIzw2uuMwabVQAAAAAOgAAAAAIAACAAAAAQrdEItF1t69HcU6PxwbnxIdqFx9doRK%2FU7hOpQkxQsjAAAAAeWYQCQuW0RdzXC089Lq9qG5Xq6WlkQPFe%2Bc68tVpL2snOJgzQcGH2%2FgpwcNATeaNAAAAA8u5f1vxqkylKi5j5Yt0NvVgBvH7228ULKjuitp4i4ab6QXg4zhNAkWKI%2FG0OfoBB8bJupD%2FwHsDnZ825XIewMw%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FUserRegister&browserName=Chrome'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
          - url: 'http://localhost:39400/410ca67ca57a4811979f53c7de2dd2fa/arterySignalR/negotiate'
            method: GET
            label: 'http://localhost:39400/410ca67ca57a4811979f53c7de2dd2fa/arterySignalR/negotiate'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
            body:
              requestUrl: 'http://localhost:33143/UserRegister'
              browserName: Chrome
              clientProtocol: '1.3'
              _: '1545717227805'
          - url: 'http://localhost:33143/__browserLink/requestData/1e0d4d5a27a6477a9a8cc3749b588ec9'
            method: GET
            label: 'http://localhost:33143/__browserLink/requestData/1e0d4d5a27a6477a9a8cc3749b588ec9'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              X-Requested-With: XMLHttpRequest